# Training phase 1 Pandas

### 1 - Import and configure to view all data correctly

In [579]:
import requests
import pandas as pd
import numpy as np

download_url = "https://raw.githubusercontent.com/fivethirtyeight/data/master/nba-elo/nbaallelo.csv"
target_csv_path = "nba_all_elo.csv"

response = requests.get(download_url)
response.raise_for_status()    # Check that the request was successful
with open(target_csv_path, "wb") as f:
    f.write(response.content)
print("Download ready.")

nba = pd.read_csv("nba_all_elo.csv")
type(nba)

Download ready.

pandas.core.frame.DataFrame

In [580]:
# see how mutch data file contains len for row shape for column
len(nba)
nba.shape

(126314, 23)

In [581]:
## see the first 5 lines
nba.head()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,66,1300.00,1293.28,40.29,NYK,Knicks,68,1300.00,1306.72,H,L,0.64,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,68,1300.00,1306.72,41.71,TRH,Huskies,66,1300.00,1293.28,A,W,0.36,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,63,1300.00,1309.65,42.01,NYK,Knicks,47,1306.72,1297.07,H,W,0.63,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,47,1306.72,1297.07,40.69,CHS,Stags,63,1300.00,1309.65,A,L,0.37,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,33,1300.00,1279.62,38.86,WSC,Capitols,50,1300.00,1320.38,H,L,0.64,NaN

In [582]:
# configure to display all columns
pd.set_option("display.max.columns", None)

In [583]:
# set floating display to precision 2
pd.set_option("display.precision", 2)

In [584]:
# see the last 5 lines
nba.tail()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
126309,63155,201506110CLE,NBA,0,2015,6/11/2015,100,1,CLE,Cavaliers,82,1723.41,1704.39,60.31,GSW,Warriors,103,1790.96,1809.98,H,L,0.55,NaN
126310,63156,201506140GSW,NBA,0,2015,6/14/2015,102,1,GSW,Warriors,104,1809.98,1813.63,68.01,CLE,Cavaliers,91,1704.39,1700.74,H,W,0.77,NaN
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,91,1704.39,1700.74,60.01,GSW,Warriors,104,1809.98,1813.63,A,L,0.23,NaN
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,97,1700.74,1692.09,59.29,GSW,Warriors,105,1813.63,1822.29,H,L,0.48,NaN
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,105,1813.63,1822.29,68.52,CLE,Cavaliers,97,1700.74,1692.09,A,W,0.52,NaN

In [585]:
nba.tail(3)

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,91,1704.39,1700.74,60.01,GSW,Warriors,104,1809.98,1813.63,A,L,0.23,NaN
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,97,1700.74,1692.09,59.29,GSW,Warriors,105,1813.63,1822.29,H,L,0.48,NaN
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,105,1813.63,1822.29,68.52,CLE,Cavaliers,97,1700.74,1692.09,A,W,0.52,NaN

In [586]:
# see data type
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 23 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
dtypes: float64(6), int64(7), object(10)
memory usage: 22.2+ MB

In [587]:
# see the values each columns contains
nba.describe()

,gameorder,_iscopy,year_id,seasongame,is_playoffs,pts,elo_i,elo_n,win_equiv,opp_pts,opp_elo_i,opp_elo_n,forecast
count,126314.00,126314.0,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00
mean,31579.00,0.5,1988.20,43.53,0.06,102.73,1495.24,1495.24,41.71,102.73,1495.24,1495.24,0.50
std,18231.93,0.5,17.58,25.38,0.24,14.81,112.14,112.46,10.63,14.81,112.14,112.46,0.22
min,1.00,0.0,1947.00,1.00,0.00,0.00,1091.64,1085.77,10.15,0.00,1091.64,1085.77,0.02
25%,15790.00,0.0,1975.00,22.00,0.00,93.00,1417.24,1416.99,34.10,93.00,1417.24,1416.99,0.33
50%,31579.00,0.5,1990.00,43.00,0.00,103.00,1500.95,1500.95,42.11,103.00,1500.95,1500.95,0.50
75%,47368.00,1.0,2003.00,65.00,0.00,112.00,1576.06,1576.29,49.64,112.00,1576.06,1576.29,0.67
max,63157.00,1.0,2015.00,108.00,1.00,186.00,1853.10,1853.10,71.11,186.00,1853.10,1853.10,0.98

In [588]:
# include object, we can observe the contain of object type in column fran_id or team_id for exemple 
# Lakers are te top one in fran_id and bos for opp_id.
nba.describe(include=object)

,game_id,lg_id,date_game,team_id,fran_id,opp_id,opp_fran,game_location,game_result,notes
count,126314,126314,126314,126314,126314,126314,126314,126314,126314,5424
unique,63157,2,12426,104,53,104,53,3,2,231
top,201506170CLE,NBA,4/17/2013,BOS,Lakers,BOS,Lakers,H,L,at New York NY
freq,2,118016,30,5997,6024,5997,6024,63138,63157,440

### 2 - Exploring Dataset

In [589]:
#see the total values of contain team_id
nba["team_id"].value_counts()

team_id
BOS    5997
NYK    5769
LAL    5078
DET    4985
PHI    4533
       ...
PIT      60
INJ      60
TRH      60
DTF      60
SDS      11
Name: count, Length: 104, dtype: int64

In [590]:
#see the total values of contain fran_id
nba["fran_id"].value_counts()

fran_id
Lakers          6024
Celtics         5997
Knicks          5769
Warriors        5657
Pistons         5650
Sixers          5644
Hawks           5572
Kings           5475
Wizards         4582
Spurs           4309
Bulls           4307
Pacers          4227
Thunder         4178
Rockets         4154
Nuggets         4120
Nets            4106
Suns            4080
Bucks           4034
Trailblazers    3870
Cavaliers       3810
Clippers        3733
Jazz            3555
Mavericks       3013
Heat            2371
Pelicans        2254
Magic           2207
Timberwolves    2131
Grizzlies       1657
Raptors         1634
Hornets          894
Colonels         846
Squires          799
Spirits          777
Stars            756
Sounds           697
Baltimore        467
Floridians       440
Condors          430
Capitols         291
Olympians        282
Sails            274
Stags            260
Bombers          249
Steamrollers     168
Packers           72
Redskins          65
Rebels            63
Waterloo          62
Denver            62
Ironmen           60
Jets              60
Huskies           60
Falcons           60
Name: count, dtype: int64

In [591]:
# see all the team for one franchise_id
nba.loc[nba["fran_id"] == "Lakers", "team_id"].value_counts()

team_id
LAL    5078
MNL     946
Name: count, dtype: int64

In [592]:
#define a colum to converts the value of date-game to the datetime data type
nba["date_played"] = pd.to_datetime(nba["date_game"])

#define a temporality with the first date and last date
nba.loc[nba["team_id"] == "MNL", "date_played"].min()
nba.loc[nba["team_id"] == "MNL", "date_played"].max()

#aggrete the new values
nba.loc[nba["team_id"] == "MNL", "date_played"].agg(("min", "max"))

min   1948-11-04
max   1960-03-26
Name: date_played, dtype: datetime64[ns]

In [593]:
nba.loc[nba["fran_id"] == "Celtics", "team_id"].value_counts()

team_id
BOS    5997
Name: count, dtype: int64

In [594]:
nba.loc[nba["team_id"] == "BOS", "fran_id"].value_counts()

fran_id
Celtics    5997
Name: count, dtype: int64

In [595]:
# make the sum of total values to column pts
nba.loc[nba["team_id"] == "BOS", "pts"].sum()

np.int64(626484)

### 3 - Getting to Know pandas’ Data Structures

In [596]:
# series object
revenues = pd.Series([5555, 7000, 1980])
revenues

0    5555
1    7000
2    1980
dtype: int64

In [597]:
# a series object wraps two components, a sequence of values and a sequence of identifiers
revenues.values

array([5555, 7000, 1980])

In [598]:
revenues.index

RangeIndex(start=0, stop=3, step=1)

In [599]:
type(revenues.values)

numpy.ndarray

In [600]:
city_revenues = pd.Series(
    [4200, 8000, 6500],
    index=["Amsterdam", "Toronto", "Tokyo"]
)
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [601]:
dpt_france = pd.Series(
    [10,11,9,66],
    index=["Aube", "Aude", "Ariège", "Pyrénées-Orientales"]
)
print("Département en france :\n",dpt_france)

Département en france :
 Aube                   10
Aude                   11
Ariège                  9
Pyrénées-Orientales    66
dtype: int64

In [602]:
# create dictionary series with key in index and values in value
studiant_per_modules = pd.Series({"cyber-security": 10, "data-management": 15})
studiant_per_modules

cyber-security     10
data-management    15
dtype: int64

In [603]:
# see the key
studiant_per_modules.keys()

Index(['cyber-security', 'data-management'], dtype='object')

In [604]:
# see if a key exist
"cyber-security" in studiant_per_modules

True

In [605]:
# see if a key exist
"management" in studiant_per_modules

False

### 4 - Understanding DataFrame Objects

In [606]:
# combine these object in a dataframe
studiant_data = pd.DataFrame({
    "location": dpt_france,
    "studiant_count_modules": studiant_per_modules
})

studiant_data

                     location  studiant_count_modules
Ariège                    9.0                     NaN
Aube                     10.0                     NaN
Aude                     11.0                     NaN
Pyrénées-Orientales      66.0                     NaN
cyber-security            NaN                    10.0
data-management           NaN                    15.0

In [607]:
studiant_data.index

Index(['Ariège', 'Aube', 'Aude', 'Pyrénées-Orientales', 'cyber-security',
       'data-management'],
      dtype='object')

In [608]:
studiant_data.values

array([[ 9., nan],
       [10., nan],
       [11., nan],
       [66., nan],
       [nan, 10.],
       [nan, 15.]])

In [609]:
# see this datafram in 2 dimensions with axes
studiant_data.axes

[Index(['Ariège', 'Aube', 'Aude', 'Pyrénées-Orientales', 'cyber-security',
        'data-management'],
       dtype='object'),
 Index(['location', 'studiant_count_modules'], dtype='object')]

In [610]:
studiant_data.axes[0]

Index(['Ariège', 'Aube', 'Aude', 'Pyrénées-Orientales', 'cyber-security',
       'data-management'],
      dtype='object')

In [611]:
studiant_data.axes[1]

Index(['location', 'studiant_count_modules'], dtype='object')

In [612]:
studiant_data.keys()

Index(['location', 'studiant_count_modules'], dtype='object')

In [613]:
for key in studiant_data.keys():
    print(key)

location
studiant_count_modules

In [614]:
print(studiant_data["location"])

Ariège                  9.0
Aube                   10.0
Aude                   11.0
Pyrénées-Orientales    66.0
cyber-security          NaN
data-management         NaN
Name: location, dtype: float64

In [615]:
# DataFrame copy
new_studiant_data = studiant_data.copy() 

# transform NaN value on values here 31
new_studiant_data["location"] = new_studiant_data["location"].fillna(31)

#Transform columns location of dataframe in int values
new_studiant_data["location"] = new_studiant_data["location"].astype("Int64")
new_studiant_data.head()

                     location  studiant_count_modules
Ariège                      9                     NaN
Aube                       10                     NaN
Aude                       11                     NaN
Pyrénées-Orientales        66                     NaN
cyber-security             31                    10.0

In [616]:
nba.axes

[RangeIndex(start=0, stop=126314, step=1),
 Index(['gameorder', 'game_id', 'lg_id', '_iscopy', 'year_id', 'date_game',
        'seasongame', 'is_playoffs', 'team_id', 'fran_id', 'pts', 'elo_i',
        'elo_n', 'win_equiv', 'opp_id', 'opp_fran', 'opp_pts', 'opp_elo_i',
        'opp_elo_n', 'game_location', 'game_result', 'forecast', 'notes',
        'date_played'],
       dtype='object')]

In [617]:
nba.axes[0]

RangeIndex(start=0, stop=126314, step=1)

In [618]:
nba.axes[1]

Index(['gameorder', 'game_id', 'lg_id', '_iscopy', 'year_id', 'date_game',
       'seasongame', 'is_playoffs', 'team_id', 'fran_id', 'pts', 'elo_i',
       'elo_n', 'win_equiv', 'opp_id', 'opp_fran', 'opp_pts', 'opp_elo_i',
       'opp_elo_n', 'game_location', 'game_result', 'forecast', 'notes',
       'date_played'],
      dtype='object')

In [619]:
# know if points or pts is presents on a dataframe -> "points" in nba.keys(); "pts" in nba.keys(); but with style :
if("points" in nba.keys()== True):
    print("The column is called 'points', not 'pts'.")
elif("pts" in nba.keys() and "points" in nba.keys()== True):
    print("the two columns are presents")
else:print("The column is called 'pts', not 'points'.")

The column is called 'pts', not 'points'.

### 5 - Accessing Series Elements

In [620]:
colors = pd.Series(
    ["red", "purple", "blue", "green", "yellow"],
    index=[1, 2, 3, 5, 8]
)
colors

1       red
2    purple
3      blue
5     green
8    yellow
dtype: object

In [621]:
colors[1]

'red'

In [622]:
# Acces by label index in a object series -> explicite index
colors.loc[1]

'red'

In [623]:
# Acces by positional index object series -> implicite index
colors.iloc[1]

'purple'

In [624]:
# Return the elements with the implicit index: 1, 2
colors.iloc[1:3]

2    purple
3      blue
dtype: object

In [625]:
# Return the elements with the explicit index between 3 and 8
colors.loc[3:8]

3      blue
5     green
8    yellow
dtype: object

In [626]:
# have same in implicit index
colors.iloc[2:6]

3      blue
5     green
8    yellow
dtype: object

In [627]:
# For see where data = -2 element of object series 
colors.iloc[-2]

'green'

#### 6 - Accessing DataFrame Elements

In [628]:
# If the dataframe as a dictionary and are values series, use the indexing operator for see the column
new_studiant_data["location"]

Ariège                  9
Aube                   10
Aude                   11
Pyrénées-Orientales    66
cyber-security         31
data-management        31
Name: location, dtype: Int64

In [629]:
type(new_studiant_data["location"])

pandas.core.series.Series

In [630]:
#If the column name is a string, then you can use attribute-style accessing with dot notation
new_studiant_data.location

Ariège                  9
Aube                   10
Aude                   11
Pyrénées-Orientales    66
cyber-security         31
data-management        31
Name: location, dtype: Int64

In [631]:
toys = pd.DataFrame([
    {"name": "ball", "shape": "sphere"},
    {"name": "Rubik's cube", "shape": "cube"}
])

In [632]:
toys["shape"]

0    sphere
1      cube
Name: shape, dtype: object

In [633]:
# Attribute-style access can lead to ambiguous results. 
# In this example, it's similar to using new_studiant_data.location, 
# but the result is different because 'shape' is already an attribute in pandas:
toys.shape

(2, 2)

In [634]:
# practice .loc and Iloc on a bigger dataset nba
# display the second-to-last row of the nba dataset. 
nba.iloc[-2]

gameorder                      63157
game_id                 201506170CLE
lg_id                            NBA
_iscopy                            0
year_id                         2015
date_game                  6/16/2015
seasongame                       102
is_playoffs                        1
team_id                          CLE
fran_id                    Cavaliers
pts                               97
elo_i                        1700.74
elo_n                        1692.09
win_equiv                      59.29
opp_id                           GSW
opp_fran                    Warriors
opp_pts                          105
opp_elo_i                    1813.63
opp_elo_n                    1822.29
game_location                      H
game_result                        L
forecast                        0.48
notes                            NaN
date_played      2015-06-16 00:00:00
Name: 126312, dtype: object

In [635]:
# Select all games between the labels 5555 and 5559
nba.loc[5555:5559, ["fran_id", "opp_fran", "pts", "opp_pts"]]

      fran_id  opp_fran  pts  opp_pts
5555  Pistons  Warriors   83       56
5556  Celtics    Knicks   95       74
5557   Knicks   Celtics   74       95
5558    Kings    Sixers   81       86
5559   Sixers     Kings   86       81

#### 7- Querying Your Dataset

In [636]:
nba.head()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes,date_played
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,66,1300.00,1293.28,40.29,NYK,Knicks,68,1300.00,1306.72,H,L,0.64,NaN,1946-11-01
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,68,1300.00,1306.72,41.71,TRH,Huskies,66,1300.00,1293.28,A,W,0.36,NaN,1946-11-01
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,63,1300.00,1309.65,42.01,NYK,Knicks,47,1306.72,1297.07,H,W,0.63,NaN,1946-11-02
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,47,1306.72,1297.07,40.69,CHS,Stags,63,1300.00,1309.65,A,L,0.37,NaN,1946-11-02
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,33,1300.00,1279.62,38.86,WSC,Capitols,50,1300.00,1320.38,H,L,0.64,NaN,1946-11-02

In [637]:
# create new datafrma who have only contains games played after 2010
current_decade = nba[nba["year_id"] > 2010]

In [638]:
current_decade.shape

(12658, 24)

In [639]:
# select the rows where a specific field is not null:
games_with_notes = nba[nba["notes"].notnull()]

In [640]:
games_with_notes.shape

(5424, 24)

In [641]:
# select the rows where a specific field is not null:
games_notna = nba[nba["notes"].notna()]

In [642]:
games_notna.shape

(5424, 24)

In [643]:
# select values of type str with ers in the end of ers
ers = nba[nba["fran_id"].str.endswith("ers")]
ers.shape

(27797, 24)

In [644]:
ers.head()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes,date_played
7,4,194611020PRO,NBA,0,1947,11/2/1946,1,0,PRO,Steamrollers,59,1300.00,1305.15,41.54,BOS,Celtics,53,1300.00,1294.85,H,W,0.64,NaN,1946-11-02
9,5,194611020STB,NBA,0,1947,11/2/1946,1,0,STB,Bombers,56,1300.00,1304.69,41.49,PIT,Ironmen,51,1300.00,1295.31,H,W,0.64,NaN,1946-11-02
16,9,194611050DTF,NBA,1,1947,11/5/1946,2,0,STB,Bombers,53,1304.69,1312.85,42.35,DTF,Falcons,49,1279.62,1271.46,A,W,0.39,NaN,1946-11-05
20,11,194611070PRO,NBA,0,1947,11/7/1946,2,0,PRO,Steamrollers,73,1305.15,1311.50,42.21,CHS,Stags,65,1316.08,1309.73,H,W,0.63,NaN,1946-11-07
22,12,194611070STB,NBA,0,1947,11/7/1946,3,0,STB,Bombers,63,1312.85,1302.60,41.27,NYK,Knicks,68,1297.07,1307.32,H,L,0.66,NaN,1946-11-07

In [645]:
nba[
    (nba["_iscopy"] == 0) &
    (nba["pts"] > 100) &
    (nba["opp_pts"] > 100) &
    (nba["team_id"] == "BLB")
]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes,date_played
1726,864,194902260BLB,NBA,0,1949,2/26/1949,53,0,BLB,Baltimore,114,1421.94,1419.43,38.56,MNL,Lakers,115,1637.99,1640.49,H,L,0.34,NaN,1949-02-26
4890,2446,195301100BLB,NBA,0,1953,1/10/1953,32,0,BLB,Baltimore,126,1328.67,1356.65,25.80,BOS,Celtics,105,1591.14,1563.17,H,W,0.28,NaN,1953-01-10
4909,2455,195301140BLB,NBA,0,1953,1/14/1953,34,0,BLB,Baltimore,104,1349.83,1346.36,24.88,MNL,Lakers,112,1665.44,1668.91,H,L,0.22,NaN,1953-01-14
5208,2605,195303110BLB,NBA,0,1953,3/11/1953,66,0,BLB,Baltimore,107,1284.52,1282.24,19.58,NYK,Knicks,113,1649.15,1651.44,H,L,0.18,at Boston MA,1953-03-11
5825,2913,195402220BLB,NBA,0,1954,2/22/1954,60,0,BLB,Baltimore,110,1303.75,1301.97,20.74,BOS,Celtics,111,1591.49,1593.27,H,L,0.25,at Worcester MA,1954-02-22

In [646]:
# create a new query, find two matches from 1992 for the Los Angeles teams where they did not play at home
nba[
    (nba["team_id"].str.startswith("LA")) &
    (nba["year_id"]==1992) &
    (nba["notes"].notnull())
]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes,date_played
68901,34451,199205030LAC,NBA,0,1992,5/3/1992,86,1,LAC,Clippers,115,1546.90,1556.0,47.89,UTA,Jazz,107,1647.51,1638.41,H,W,0.50,"at Anaheim, CA (Anaheim Convention Center)",1992-05-03
68903,34452,199205030LAL,NBA,0,1992,5/3/1992,86,1,LAL,Lakers,76,1489.65,1474.4,39.40,POR,Trailblazers,102,1655.12,1670.37,H,L,0.41,"at Las Vegas, NV",1992-05-03

#### 8 - Grouping and Aggregating Your Data

In [647]:
# some examples
new_studiant_data.sum()

location                  158.0
studiant_count_modules     25.0
dtype: Float64

In [648]:
new_studiant_data.max()

location                  66.0
studiant_count_modules    15.0
dtype: Float64

In [649]:
# aggregations with groupby
nba.groupby("fran_id", sort=False)["pts"].sum()

fran_id
Huskies           3995
Knicks          582497
Stags            20398
Falcons           3797
Capitols         22387
Celtics         626484
Steamrollers     12372
Ironmen           3674
Bombers          17793
Rebels            4474
Warriors        591224
Baltimore        37219
Jets              4482
Pistons         572758
Lakers          637444
Kings           569245
Hawks           567261
Denver            4818
Olympians        22864
Redskins          5372
Waterloo          4921
Packers           6193
Sixers          585891
Wizards         474809
Bulls           437269
Thunder         437735
Squires          91127
Stars            84940
Rockets         432504
Colonels         94435
Pacers          438288
Nuggets         445780
Spurs           453822
Spirits          85874
Sounds           75582
Floridians       49568
Nets            417809
Condors          49642
Bucks           418326
Suns            437486
Clippers        380523
Cavaliers       380416
Trailblazers    402695
Sails            30080
Jazz            363155
Mavericks       309239
Pelicans        220794
Heat            229103
Timberwolves    207693
Magic           219436
Grizzlies       157683
Raptors         158370
Hornets          84489
Name: pts, dtype: int64

In [650]:
# group by multiple columns 
nba[
    (nba["fran_id"] == "Spurs") &
    (nba["year_id"] > 2010)
].groupby(["year_id", "game_result"])["game_id"].count()

year_id  game_result
2011     L              25
         W              63
2012     L              20
         W              60
2013     L              30
         W              73
2014     L              27
         W              78
2015     L              31
         W              58
Name: game_id, dtype: int64

In [651]:
#create a new query : Golden state warriors season [year_id = 2015] how W and L in th regular season and playoffs
nba[
    (nba["fran_id"] == "Warriors") &
    (nba["year_id"] == 2015)
].groupby(["is_playoffs","game_result"])["game_id"].count()

is_playoffs  game_result
0            L              15
             W              67
1            L               5
             W              16
Name: game_id, dtype: int64

#### 9 - Manipulating Columns

In [652]:
df = nba.copy()
df.shape

(126314, 24)

In [653]:
# create a new column for calcule for example
df["difference"] = df.pts - df.opp_pts
df.shape

(126314, 25)

In [654]:
df["difference"].max()

np.int64(68)

In [655]:
# rename colonne
rename_df = df.rename(
    columns={"game_result": "result", "game_location": "location"}
)
rename_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 25 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   gameorder    126314 non-null  int64
 1   game_id      126314 non-null  object
 2   lg_id        126314 non-null  object
 3   _iscopy      126314 non-null  int64
 4   year_id      126314 non-null  int64
 5   date_game    126314 non-null  object
 6   seasongame   126314 non-null  int64
 7   is_playoffs  126314 non-null  int64
 8   team_id      126314 non-null  object
 9   fran_id      126314 non-null  object
 10  pts          126314 non-null  int64
 11  elo_i        126314 non-null  float64
 12  elo_n        126314 non-null  float64
 13  win_equiv    126314 non-null  float64
 14  opp_id       126314 non-null  object
 15  opp_fran     126314 non-null  object
 16  opp_pts      126314 non-null  int64
 17  opp_elo_i    126314 non-null  float64
 18  opp_elo_n    126314 non-null  float64
 19  location     126314 non-null  object
 20  result       126314 non-null  object
 21  forecast     126314 non-null  float64
 22  notes        5424 non-null    object
 23  date_played  126314 non-null  datetime64[ns]
 24  difference   126314 non-null  int64
dtypes: datetime64[ns](1), float64(6), int64(8), object(10)
memory usage: 24.1+ MB

In [656]:
nba.rename(
    columns={"seasongame":"season"},
    inplace=True
)
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 24 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   season         126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
 23  date_played    126314 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(6), int64(7), object(10)
memory usage: 23.1+ MB

In [657]:
# delete columns don't needed
df.shape

(126314, 25)

In [658]:
elo_columns = ["elo_i", "elo_n", "opp_elo_i", "opp_elo_n"]
df.drop(elo_columns, inplace=True, axis=1)
df.shape

(126314, 21)

#### 10 - Specifying Data Types

In [659]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 21 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  win_equiv      126314 non-null  float64
 12  opp_id         126314 non-null  object
 13  opp_fran       126314 non-null  object
 14  opp_pts        126314 non-null  int64
 15  game_location  126314 non-null  object
 16  game_result    126314 non-null  object
 17  forecast       126314 non-null  float64
 18  notes          5424 non-null    object
 19  date_played    126314 non-null  datetime64[ns]
 20  difference     126314 non-null  int64
dtypes: datetime64[ns](1), float64(2), int64(8), object(10)
memory usage: 20.2+ MB

In [661]:
# Transform the data type object 
df["date_game"] = pd.to_datetime(df["date_game"])

In [662]:
df["date_game"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 126314 entries, 0 to 126313
Series name: date_game
Non-Null Count   Dtype
--------------   -----
126314 non-null  datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 987.0 KB

In [ ]:
#search number of disctinct values in game_location
df["game_location"].nunique()

3

In [ ]:
# see the differents values of contain game_location
df["game_location"].value_counts()

game_location
H    63138
A    63138
N       38
Name: count, dtype: int64

In [668]:
# For this type of data, we will use the categorical data type, its equal to enum in db
df["game_location"] = pd.Categorical(df["game_location"])
df["game_location"].dtype

CategoricalDtype(categories=['A', 'H', 'N'], ordered=False, categories_dtype=object)

In [ ]:
df.info()